Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F04KL101.h
#define _T3GCON_TMR3GE_POSITION                  0x00000007
#define _T3GCON_TMR3GE_MASK                      0x00000080
#define _T3GCON_TMR3GE_LENGTH                    0x00000001

#define _T3GCON_T3GSS0_POSITION                  0x00000000
#define _T3GCON_T3GSS0_MASK                      0x00000001
#define _T3GCON_T3GSS0_LENGTH                    0x00000001

#define _T3GCON_T3GSS1_POSITION                  0x00000001
#define _T3GCON_T3GSS1_MASK                      0x00000002
#define _T3GCON_T3GSS1_LENGTH                    0x00000001

#define _T3GCON_NOT_T3DONE_POSITION              0x00000003
#define _T3GCON_NOT_T3DONE_MASK                  0x00000008
#define _T3GCON_NOT_T3DONE_LENGTH                0x00000001

#define _T3GCON_TGSS_POSITION                    0x00000000
#define _T3GCON_TGSS_MASK                        0x00000003
#define _T3GCON_TGSS_LENGTH                      0x00000002

#define _T3GCON_TGVAL_POSITION                   0x00000002
#define _T3GCON_TGVAL_MASK                       0x00000004
#define _T3GCON_TGVAL_LENGTH                     0x00000001

#define _T3GCON_TGGO_POSITION                    0x00000003
#define _T3GCON_TGGO_MASK                        0x00000008
#define _T3GCON_TGGO_LENGTH                      0x00000001

#define _T3GCON_TGSE_POSITION                    0x00000004
#define _T3GCON_TGSE_MASK                        0x00000010
#define _T3GCON_TGSE_LENGTH                      0x00000001

#define _T3GCON_TGTM_POSITION                    0x00000005
#define _T3GCON_TGTM_MASK                        0x00000020
#define _T3GCON_TGTM_LENGTH                      0x00000001

#define _T3GCON_TGPOL_POSITION                   0x00000006
#define _T3GCON_TGPOL_MASK                       0x00000040
#define _T3GCON_TGPOL_LENGTH                     0x00000001

#define _T3GCON_TGATE_POSITION                   0x00000007
#define _T3GCON_TGATE_MASK                       0x00000080
#define _T3GCON_TGATE_LENGTH                     0x00000001

#define _T3CON_TMR3ON_POSITION                   0x00000000
#define _T3CON_TMR3ON_MASK                       0x00000001
#define _T3CON_TMR3ON_LENGTH                     0x00000001

#define _T3CON_NOT_T3SYNC_POSITION               0x00000002
#define _T3CON_NOT_T3SYNC_MASK                   0x00000004
#define _T3CON_NOT_T3SYNC_LENGTH                 0x00000001

#define _T3CON_T3OSCEN_POSITION                  0x00000003
#define _T3CON_T3OSCEN_MASK                      0x00000008
#define _T3CON_T3OSCEN_LENGTH                    0x00000001

#define _T3CON_T3CKPS_POSITION                   0x00000004
#define _T3CON_T3CKPS_MASK                       0x00000030
#define _T3CON_T3CKPS_LENGTH                     0x00000002

#define _T3CON_TMR3CS_POSITION                   0x00000006
#define _T3CON_TMR3CS_MASK                       0x000000C0
#define _T3CON_TMR3CS_LENGTH                     0x00000002

#define _T3CON_TON_POSITION                      0x00000000
#define _T3CON_TON_MASK                          0x00000001
#define _T3CON_TON_LENGTH                        0x00000001

#define _T3CON_NOT_TSYNC_POSITION                0x00000002
#define _T3CON_NOT_TSYNC_MASK                    0x00000004
#define _T3CON_NOT_TSYNC_LENGTH                  0x00000001

#define _T3CON_SOSCEN_POSITION                   0x00000003
#define _T3CON_SOSCEN_MASK                       0x00000008
#define _T3CON_SOSCEN_LENGTH                     0x00000001

#define _T3CON_TCKPS_POSITION                    0x00000004
#define _T3CON_TCKPS_MASK                        0x00000030
#define _T3CON_TCKPS_LENGTH                      0x00000002

#define _T3CON_TCS_POSITION                      0x00000006
#define _T3CON_TCS_MASK                          0x000000C0
#define _T3CON_TCS_LENGTH                        0x00000002

#define _T3CON_T3CKPS0_POSITION                  0x00000004
#define _T3CON_T3CKPS0_MASK                      0x00000010
#define _T3CON_T3CKPS0_LENGTH                    0x00000001

#define _T3CON_T3CKPS1_POSITION                  0x00000005
#define _T3CON_T3CKPS1_MASK                      0x00000020
#define _T3CON_T3CKPS1_LENGTH                    0x00000001

#define _T3CON_TMR3CS0_POSITION                  0x00000006
#define _T3CON_TMR3CS0_MASK                      0x00000040
#define _T3CON_TMR3CS0_LENGTH                    0x00000001

#define _T3CON_TMR3CS1_POSITION                  0x00000007
#define _T3CON_TMR3CS1_MASK                      0x00000080
#define _T3CON_TMR3CS1_LENGTH                    0x00000001

#define _CCP1CON_CCPM_POSITION                   0x00000000
#define _CCP1CON_CCPM_MASK                       0x0000000F
#define _CCP1CON_CCPM_LENGTH                     0x00000004

#define _CCP1CON_DCB_POSITION                    0x00000004
#define _CCP1CON_DCB_MASK                        0x00000030
#define _CCP1CON_DCB_LENGTH                      0x00000002

#define _CCP1CON_PM_POSITION                     0x00000006
#define _CCP1CON_PM_MASK                         0x000000C0
#define _CCP1CON_PM_LENGTH                       0x00000002

#define _CCP1CON_CCPM0_POSITION                  0x00000000
#define _CCP1CON_CCPM0_MASK                      0x00000001
#define _CCP1CON_CCPM0_LENGTH                    0x00000001

#define _CCP1CON_CCPM1_POSITION                  0x00000001
#define _CCP1CON_CCPM1_MASK                      0x00000002
#define _CCP1CON_CCPM1_LENGTH                    0x00000001

#define _CCP1CON_CCPM2_POSITION                  0x00000002
#define _CCP1CON_CCPM2_MASK                      0x00000004
#define _CCP1CON_CCPM2_LENGTH                    0x00000001

#define _CCP1CON_CCPM3_POSITION                  0x00000003
#define _CCP1CON_CCPM3_MASK                      0x00000008
#define _CCP1CON_CCPM3_LENGTH                    0x00000001

#define _CCP1CON_DCB0_POSITION                   0x00000004
#define _CCP1CON_DCB0_MASK                       0x00000010
#define _CCP1CON_DCB0_LENGTH                     0x00000001

#define _CCP1CON_DCB1_POSITION                   0x00000005
#define _CCP1CON_DCB1_MASK                       0x00000020
#define _CCP1CON_DCB1_LENGTH                     0x00000001

#define _CCP1CON_PM0_POSITION                    0x00000006
#define _CCP1CON_PM0_MASK                        0x00000040
#define _CCP1CON_PM0_LENGTH                      0x00000001

